ZigEmbeddedGroup/texasinstruments-data/ccs_base/common/targetdb/Modules/msp/mspm0g511x/VREF_1.0.xml
<?xml version="1.0" encoding="UTF-8"?>
<module id="VREF" HW_revision="1.0">
    <group id="VREF_GPRCM" name="VREF_GPRCM" instances="1" offset="0x800" instaddr="0x100" description="">
        <register id="VREF_PWREN" width="32" offset="0x0" description="Power enable">
            <bitfield id="ENABLE" description="Enable the power" begin="0" end="0" width="1" rwaccess="R/W">
                <bitenum id="DISABLE" value="0x0" description="Disable Power"/>
                <bitenum id="ENABLE" value="0x1" description="Enable Power"/>
            </bitfield>
        </register>
        <register id="VREF_RSTCTL" width="32" offset="0x4" description="Reset Control">
            <bitfield id="RESETSTKYCLR" description="Clear the RESETSTKY bit in the STAT register" begin="1" end="1" width="1" rwaccess="R/W">
                <bitenum id="NOP" value="0x0" description="Writing 0 has no effect"/>
                <bitenum id="CLR" value="0x1" description="Clear reset sticky bit"/>
            </bitfield>
            <bitfield id="RESETASSERT" description="Assert reset to the peripheral" begin="0" end="0" width="1" rwaccess="R/W">
                <bitenum id="NOP" value="0x0" description="Writing 0 has no effect"/>
                <bitenum id="ASSERT" value="0x1" description="Assert reset"/>
            </bitfield>
        </register>
        <register id="VREF_STAT" width="32" offset="0x14" description="Status Register">
            <bitfield id="RESETSTKY" description="This bit indicates, if the peripheral was reset, since this bit was cleared by RESETSTKYCLR in the RSTCTL register" begin="16" end="16" width="1" rwaccess="R">
                <bitenum id="NORES" value="0x0" description="The peripheral has not been reset since this bit was last cleared by RESETSTKYCLR in the RSTCTL register"/>
                <bitenum id="RESET" value="0x1" description="The peripheral was reset since the last bit clear"/>
            </bitfield>
        </register>
        </group>
    <register id="VREF_CLKDIV" width="32" offset="0x1000" description="Clock Divider">
        <bitfield id="RATIO" description="Selects divide ratio of module clock to be used in sample and hold logic" begin="2" end="0" width="3" rwaccess="R/W">
        </bitfield>
    </register>
    <register id="VREF_CLKSEL" width="32" offset="0x1008" description="Clock Selection">
        <bitfield id="LFCLK_SEL" description="Selects LFCLK as clock source if enabled" begin="1" end="1" width="1" rwaccess="R/W">
        </bitfield>
        <bitfield id="MFCLK_SEL" description="Selects MFCLK as clock source if enabled" begin="2" end="2" width="1" rwaccess="R/W">
        </bitfield>
        <bitfield id="BUSCLK_SEL" description="Selects BUSCLK as clock source if enabled" begin="3" end="3" width="1" rwaccess="R/W">
        </bitfield>
    </register>
    <register id="VREF_CTL0" width="32" offset="0x1100" description="Control 0">
        <bitfield id="ENABLE" description="This bit enables the VREF module." begin="0" end="0" width="1" rwaccess="R/W">
            <bitenum id="DISABLE" value="0x0" description="VREF is disabled"/>
            <bitenum id="ENABLE" value="0x1" description="VREF is enabled"/>
        </bitfield>
        <bitfield id="BUFCONFIG" description="These bits configure output buffer." begin="7" end="7" width="1" rwaccess="R/W">
            <bitenum id="OUTPUT2P5V" value="0x0" description="Configure Output Buffer to 2.5v"/>
            <bitenum id="OUTPUT1P4V" value="0x1" description="Configure Output Buffer to 1.4v"/>
        </bitfield>
        <bitfield id="SHMODE" description="This bit enable sample and hold mode" begin="8" end="8" width="1" rwaccess="R/W">
            <bitenum id="DISABLE" value="0x0" description="Sample and hold mode is disable"/>
            <bitenum id="Enable" value="0x1" description="Sample and hold mode is enable"/>
        </bitfield>
        <bitfield id="COMP_VREF_ENABLE" description="Comparator Vref Enable" begin="1" end="1" width="1" rwaccess="R/W">
            <bitenum id="DISABLE" value="0x0" description="COMP VREF is disabled"/>
            <bitenum id="ENABLE" value="0x1" description="COMP VREF is enabled"/>
        </bitfield>
    </register>
    <register id="VREF_CTL1" width="32" offset="0x1104" description="Control 1">
        <bitfield id="READY" description="These bits defines status of VREF" begin="0" end="0" width="1" rwaccess="R">
            <bitenum id="NOTRDY" value="0x0" description="VREF output is not ready"/>
            <bitenum id="RDY" value="0x1" description="VREF output is ready"/>
        </bitfield>
    </register>
    <register id="VREF_CTL2" width="32" offset="0x1108" description="Control 2">
        <bitfield id="SHCYCLE" description="Sample and Hold cycle count
Total cycles of module clock for sample and hold phase when VREF is working in sample and hold mode in STANDBY to save power.
This field should be greater than HCYCLE field. The difference between this field and HCYCLE gives the number of cycles of sample phase.
Please refer VREF section of datasheet for recommended values of sample and hold times." begin="15" end="0" width="16" rwaccess="R/W">
            <bitenum id="MINIMUM" value="0x0" description="smallest sample and hold cycle count"/>
            <bitenum id="MAXIMUM" value="0xFFFF" description="largest sample and hold cycle"/>
        </bitfield>
        <bitfield id="HCYCLE" description="Hold cycle count
Total cycles of module clock for hold phase when VREF is working in sample and hold mode in STANDBY to save power.
Please refer VREF section of datasheet for recommended values of sample and hold times." begin="31" end="16" width="16" rwaccess="R/W">
            <bitenum id="MINIMUM" value="0x0" description="smallest hold cycle"/>
            <bitenum id="MAXIMUM" value="0xFFFF" description="largest hold cycle"/>
        </bitfield>
    </register>

</module>